; domain
(define (domain emergency-services)
  (:requirements :strips :typing)
  (:types 
    location person drone crate content arm
  ) 

  (:predicates
    (at-drone ?d - drone ?l - location)
    (at-person ?p - person ?l - location)
    (at-crate ?c - crate ?l - location)
    (hand-empty ?d - drone ?a - arm)
    (holding ?d - drone ?a - arm ?c - crate)
    (crate-content ?c - crate ?cnt - content)
    (has-content ?p - person ?cnt - content)
  )

  (:action fly
    :parameters (?d - drone ?from - location ?to - location)
    :precondition (at-drone ?d ?from)
    :effect (and (not (at-drone ?d ?from)) (at-drone ?d ?to))
  )

  (:action pick-up
    :parameters (?d - drone ?a - arm ?c - crate ?l - location)
    :precondition (and (at-drone ?d ?l) (at-crate ?c ?l) (hand-empty ?d ?a))
    :effect (and (not (at-crate ?c ?l)) (not (hand-empty ?d ?a)) (holding ?d ?a ?c))
  )

  (:action deliver
    :parameters (?d - drone ?a - arm ?c - crate ?p - person ?l - location ?cnt - content)
    :precondition (and (at-drone ?d ?l) (at-person ?p ?l) (holding ?d ?a ?c) (crate-content ?c ?cnt))
    :effect (and (not (holding ?d ?a ?c)) (hand-empty ?d ?a) (has-content ?p ?cnt))
  )
)

; problem
(define (problem problem_d1_r0_l15_p15_c15_g15)
  (:domain emergency-services)
  (:objects
    drone1 - drone
    depot - location
    loc1 - location
    loc2 - location
    loc3 - location
    loc4 - location
    loc5 - location
    loc6 - location
    loc7 - location
    loc8 - location
    loc9 - location
    loc10 - location
    loc11 - location
    loc12 - location
    loc13 - location
    loc14 - location
    loc15 - location
    person1 - person
    person2 - person
    person3 - person
    person4 - person
    person5 - person
    person6 - person
    person7 - person
    person8 - person
    person9 - person
    person10 - person
    person11 - person
    person12 - person
    person13 - person
    person14 - person
    person15 - person
    crate1 - crate
    crate2 - crate
    crate3 - crate
    crate4 - crate
    crate5 - crate
    crate6 - crate
    crate7 - crate
    crate8 - crate
    crate9 - crate
    crate10 - crate
    crate11 - crate
    crate12 - crate
    crate13 - crate
    crate14 - crate
    crate15 - crate
    food - content
    medicine - content
    left - arm
    right - arm
  )
  (:init
    (at-drone drone1 depot)
    (hand-empty drone1 left)
    (hand-empty drone1 right)
    (at-crate crate1 depot)
    (at-crate crate2 depot)
    (at-crate crate3 depot)
    (at-crate crate4 depot)
    (at-crate crate5 depot)
    (at-crate crate6 depot)
    (at-crate crate7 depot)
    (at-crate crate8 depot)
    (at-crate crate9 depot)
    (at-crate crate10 depot)
    (at-crate crate11 depot)
    (at-crate crate12 depot)
    (at-crate crate13 depot)
    (at-crate crate14 depot)
    (at-crate crate15 depot)
    (at-person person1 loc13)
    (at-person person2 loc4)
    (at-person person3 loc12)
    (at-person person4 loc15)
    (at-person person5 loc10)
    (at-person person6 loc4)
    (at-person person7 loc6)
    (at-person person8 loc13)
    (at-person person9 loc1)
    (at-person person10 loc3)
    (at-person person11 loc4)
    (at-person person12 loc5)
    (at-person person13 loc7)
    (at-person person14 loc12)
    (at-person person15 loc9)
    (crate-content crate1 food)
    (crate-content crate2 medicine)
    (crate-content crate3 medicine)
    (crate-content crate4 medicine)
    (crate-content crate5 medicine)
    (crate-content crate6 medicine)
    (crate-content crate7 medicine)
    (crate-content crate8 medicine)
    (crate-content crate9 medicine)
    (crate-content crate10 medicine)
    (crate-content crate11 medicine)
    (crate-content crate12 medicine)
    (crate-content crate13 medicine)
    (crate-content crate14 medicine)
    (crate-content crate15 medicine)
  )
  (:goal (and
    (has-content person1 medicine)
    (has-content person2 medicine)
    (has-content person3 medicine)
    (has-content person4 medicine)
    (has-content person5 medicine)
    (has-content person6 medicine)
    (has-content person7 medicine)
    (has-content person9 medicine)
    (has-content person10 medicine)
    (has-content person11 food)
    (has-content person11 medicine)
    (has-content person12 medicine)
    (has-content person13 medicine)
    (has-content person14 medicine)
    (has-content person15 medicine)
  ))
)

; plan
1. (pick-up drone1 right crate1 depot)
   deleted: (at-crate crate1 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate1)
   goals met: 0 of 15
2. (pick-up drone1 left crate2 depot)
   deleted: (at-crate crate2 depot) (hand-empty drone1 left)
   added: (holding drone1 left crate2)
   goals met: 0 of 15
3. (fly drone1 depot loc13)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc13)
   goals met: 0 of 15
4. (fly drone1 loc13 loc4)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 loc4)
   goals met: 0 of 15
5. (deliver drone1 right crate1 person11 loc4 food)
   deleted: (holding drone1 right crate1)
   added: (hand-empty drone1 right) (has-content person11 food)
   goals met: 1 of 15
6. (fly drone1 loc4 loc13)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 loc13)
   goals met: 1 of 15
7. (deliver drone1 left crate2 person1 loc13 medicine)
   deleted: (holding drone1 left crate2)
   added: (hand-empty drone1 left) (has-content person1 medicine)
   goals met: 2 of 15
8. (fly drone1 loc13 depot)
   deleted: (at-drone drone1 loc13)
   added: (at-drone drone1 depot)
   goals met: 2 of 15
9. (pick-up drone1 right crate3 depot)
   deleted: (at-crate crate3 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate3)
   goals met: 2 of 15
10. (fly drone1 depot loc15)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc15)
   goals met: 2 of 15
11. (deliver drone1 right crate3 person4 loc15 medicine)
   deleted: (holding drone1 right crate3)
   added: (hand-empty drone1 right) (has-content person4 medicine)
   goals met: 3 of 15
12. (fly drone1 loc15 depot)
   deleted: (at-drone drone1 loc15)
   added: (at-drone drone1 depot)
   goals met: 3 of 15
13. (pick-up drone1 right crate4 depot)
   deleted: (at-crate crate4 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate4)
   goals met: 3 of 15
14. (fly drone1 depot loc10)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc10)
   goals met: 3 of 15
15. (deliver drone1 right crate4 person5 loc10 medicine)
   deleted: (holding drone1 right crate4)
   added: (hand-empty drone1 right) (has-content person5 medicine)
   goals met: 4 of 15
16. (fly drone1 loc10 depot)
   deleted: (at-drone drone1 loc10)
   added: (at-drone drone1 depot)
   goals met: 4 of 15
17. (pick-up drone1 right crate5 depot)
   deleted: (at-crate crate5 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate5)
   goals met: 4 of 15
18. (fly drone1 depot loc6)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc6)
   goals met: 4 of 15
19. (deliver drone1 right crate5 person7 loc6 medicine)
   deleted: (holding drone1 right crate5)
   added: (hand-empty drone1 right) (has-content person7 medicine)
   goals met: 5 of 15
20. (fly drone1 loc6 depot)
   deleted: (at-drone drone1 loc6)
   added: (at-drone drone1 depot)
   goals met: 5 of 15
21. (pick-up drone1 right crate6 depot)
   deleted: (at-crate crate6 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate6)
   goals met: 5 of 15
22. (fly drone1 depot loc1)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc1)
   goals met: 5 of 15
23. (deliver drone1 right crate6 person9 loc1 medicine)
   deleted: (holding drone1 right crate6)
   added: (hand-empty drone1 right) (has-content person9 medicine)
   goals met: 6 of 15
24. (fly drone1 loc1 depot)
   deleted: (at-drone drone1 loc1)
   added: (at-drone drone1 depot)
   goals met: 6 of 15
25. (pick-up drone1 right crate7 depot)
   deleted: (at-crate crate7 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate7)
   goals met: 6 of 15
26. (fly drone1 depot loc3)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc3)
   goals met: 6 of 15
27. (deliver drone1 right crate7 person10 loc3 medicine)
   deleted: (holding drone1 right crate7)
   added: (hand-empty drone1 right) (has-content person10 medicine)
   goals met: 7 of 15
28. (fly drone1 loc3 depot)
   deleted: (at-drone drone1 loc3)
   added: (at-drone drone1 depot)
   goals met: 7 of 15
29. (pick-up drone1 right crate8 depot)
   deleted: (at-crate crate8 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate8)
   goals met: 7 of 15
30. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 7 of 15
31. (fly drone1 loc4 loc5)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 loc5)
   goals met: 7 of 15
32. (deliver drone1 right crate8 person12 loc5 medicine)
   deleted: (holding drone1 right crate8)
   added: (hand-empty drone1 right) (has-content person12 medicine)
   goals met: 8 of 15
33. (fly drone1 loc5 depot)
   deleted: (at-drone drone1 loc5)
   added: (at-drone drone1 depot)
   goals met: 8 of 15
34. (pick-up drone1 right crate9 depot)
   deleted: (at-crate crate9 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate9)
   goals met: 8 of 15
35. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 8 of 15
36. (fly drone1 loc4 loc7)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 loc7)
   goals met: 8 of 15
37. (deliver drone1 right crate9 person13 loc7 medicine)
   deleted: (holding drone1 right crate9)
   added: (hand-empty drone1 right) (has-content person13 medicine)
   goals met: 9 of 15
38. (fly drone1 loc7 depot)
   deleted: (at-drone drone1 loc7)
   added: (at-drone drone1 depot)
   goals met: 9 of 15
39. (pick-up drone1 right crate10 depot)
   deleted: (at-crate crate10 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate10)
   goals met: 9 of 15
40. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 9 of 15
41. (fly drone1 loc4 loc9)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 loc9)
   goals met: 9 of 15
42. (deliver drone1 right crate10 person15 loc9 medicine)
   deleted: (holding drone1 right crate10)
   added: (hand-empty drone1 right) (has-content person15 medicine)
   goals met: 10 of 15
43. (fly drone1 loc9 depot)
   deleted: (at-drone drone1 loc9)
   added: (at-drone drone1 depot)
   goals met: 10 of 15
44. (pick-up drone1 right crate11 depot)
   deleted: (at-crate crate11 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate11)
   goals met: 10 of 15
45. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 10 of 15
46. (deliver drone1 right crate11 person2 loc4 medicine)
   deleted: (holding drone1 right crate11)
   added: (hand-empty drone1 right) (has-content person2 medicine)
   goals met: 11 of 15
47. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 11 of 15
48. (pick-up drone1 right crate12 depot)
   deleted: (at-crate crate12 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate12)
   goals met: 11 of 15
49. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 11 of 15
50. (deliver drone1 right crate12 person6 loc4 medicine)
   deleted: (holding drone1 right crate12)
   added: (hand-empty drone1 right) (has-content person6 medicine)
   goals met: 12 of 15
51. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 12 of 15
52. (pick-up drone1 right crate13 depot)
   deleted: (at-crate crate13 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate13)
   goals met: 12 of 15
53. (fly drone1 depot loc4)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc4)
   goals met: 12 of 15
54. (deliver drone1 right crate13 person11 loc4 medicine)
   deleted: (holding drone1 right crate13)
   added: (hand-empty drone1 right) (has-content person11 medicine)
   goals met: 13 of 15
55. (fly drone1 loc4 depot)
   deleted: (at-drone drone1 loc4)
   added: (at-drone drone1 depot)
   goals met: 13 of 15
56. (pick-up drone1 right crate14 depot)
   deleted: (at-crate crate14 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate14)
   goals met: 13 of 15
57. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 13 of 15
58. (deliver drone1 right crate14 person3 loc12 medicine)
   deleted: (holding drone1 right crate14)
   added: (hand-empty drone1 right) (has-content person3 medicine)
   goals met: 14 of 15
59. (fly drone1 loc12 depot)
   deleted: (at-drone drone1 loc12)
   added: (at-drone drone1 depot)
   goals met: 14 of 15
60. (pick-up drone1 right crate15 depot)
   deleted: (at-crate crate15 depot) (hand-empty drone1 right)
   added: (holding drone1 right crate15)
   goals met: 14 of 15
61. (fly drone1 depot loc12)
   deleted: (at-drone drone1 depot)
   added: (at-drone drone1 loc12)
   goals met: 14 of 15
62. (deliver drone1 right crate15 person14 loc12 medicine)
   deleted: (holding drone1 right crate15)
   added: (hand-empty drone1 right) (has-content person14 medicine)
   goals met: 15 of 15
